//
//  ViewController.swift
//  MS_Shopping_Demo
//
//  Created by Ekko on 2023/03/23.
//

import UIKit

class ViewController: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()
        // Do any additional setup after loading the view.
    }


}

//少し寂しそうな君に
//스코시 사비시소오나 키미니
//조금 외로워 보이는 네게
//
//こんな歌を聴かせよう
//콘나 우타오 키카세요
//이런 노래를 들려줄게
//
//手を叩く合図
//테오 타타쿠 아이즈
//손뼉을 치는 신호
//
//雑なサプライズ
//자츠나 사프라이즈
//조잡한 서프라이즈
//
//僕なりの精一杯
//보쿠나리노 세이잇파이
//내 나름의 최선이야
//
//埃まみれ ドーナツ盤には
//호코리마미레 도나츠반니와
//먼지투성이 레코드 판에서는
//
//あの日の夢が踊る
//아노히노 유메가 오도루
//그날의 꿈이 춤을 춰
//
//真面目に針を落とす
//마지메니 하리오 오토스
//진지한 얼굴로 바늘을 내려놔
//
//息を止めすぎたぜ
//이키오 토메스기타제
//숨을 너무 오래 참았다고
//
//さあ腰を下ろしてよ
//사아 코시오 오로시테요
//자 앉아 봐
//
//フツフツと鳴り出す青春の音
//후츠후츠토 나리다스 세이슌노 오토
//끝없이 울려퍼지는 청춘의 소리
//
//乾いたメロディで踊ろうよ
//카와이타 메로디데 오도로오요
//메마른 멜로디에 맞춰 춤추자
//
//君はロックなんか聴かないと思いながら
//키미와 록쿠난카 키카나이토 오모이나가라
//너는 록 같은 거 듣지 않는다고 생각하면서
//
//少しでも僕に近づいてほしくて
//스코시데모 보쿠니 치카즈이테호시쿠테
//조금이라도 내게 다가와 주길 원해서
//
//ロックなんか聴かないと思うけれども
//록쿠난카 키카나이토 오모우케레도모
//록 같은 거 듣지 않는다고 생각하지만
//
//僕はこんな歌であんな歌で
//보쿠와 콘나 우타데 안나 우타데
//나는 이런 노래로 저런 노래로
//
//恋を乗り越えてきた
//코이오 노리코에테키타
//사랑을 이겨낸 거야
//
//僕の心臓のBPMは
//보쿠노 신조노 비피에무와
//내 심장의 BPM은
//
//190になったぞ
//햐쿠큐쥬니 낫타조
//190을 넘었어
//
//君は気づくのかい？
//키미와 키즈쿠노카이
//눈치채고 있니?
//
//なぜ今笑うんだい？
//나제 이마 와라운다이
//왜 지금 웃는 거야?
//
//嘘みたいに泳ぐ目
//우소미타이니 오요구 메
//거짓말처럼 눈을 피해
//
//ダラダラと流れる青春の音
//다라다라토 나가레루 세이슌노 오토
//느긋하게 흐르는 청춘의 소리
//
//乾いたメロディは止まないぜ
//카와이타 메로디와 야마나이제
//메마른 멜로디는 멈추지 않아
//
//君はロックなんか聴かないと思いながら
//키미와 록쿠난카 키카나이토 오모이나가라
//너는 록 같은 거 듣지 않는다고 생각하면서
//
//あと少し僕に近づいてほしくて
//아토스코시 보쿠니 치카즈이테 호시쿠테
//조금만 더 내게 다가와 주길 바라서
//
//ロックなんか聴かないと思うけれども
//록쿠난카 키카나이토 오모우케레도모
//록 같은 거 듣지 않는다고 생각하지만
//
//僕はこんな歌であんな歌で
//보쿠와 콘나 우타데 안나 우타데
//나는 이런 노래로 저런 노래로
//
//恋に焦がれてきたんだ
//코이니 코가레테키탄다
//사랑을 그려온 거야
//
//
//君がロックなんか聴かないこと知ってるけど
//키미가 록쿠난카 키카나이코토 싯테루케도
//네가 록 같은 거 듣지 않는다는 걸 알고 있지만
//
//恋人のように寄り添ってほしくて
//코이비토노 요오니 요리솟테 호시쿠테
//연인처럼 기대어 주길 바라서
//
//ロックなんか聴かないと思うけれども
//록쿠난카 키카나이토 오모우케레도모
//록 같은 거 듣지 않는다고 생각하지만
//
//僕はこんな歌であんな歌で
//보쿠와 콘나 우타데 안나 우타데
//나는 이런 노래로 저런 노래로
//
//また胸が痛いんだ
//마타 무네가 이타인다
//또 다시 가슴이 아파
//
//君はロックなんか聴かないと思いながら
//키미와 록쿠난카 키카나이토 오모이나가라
//너는 록 같은 거 듣지 않는다고 생각하면서
//
//少しでも僕に近づいてほしくて
//스코시데모 보쿠니 치카즈이테호시쿠테
//조금이라도 내게 다가와 주길 원해서
//
//ロックなんか聴かないと思うけれども
//록쿠난카 키카나이토 오모우케레도모
//록 같은 거 듣지 않는다고 생각하지만
//
//僕はこんな歌であんな歌で
//보쿠와 콘나 우타데 안나 우타데
//나는 이런 노래로 저런 노래로
//
//恋を乗り越えてきた
//코이오 노리코에테키타
//사랑을 이겨낸 거야
//
//恋を乗り越えてきた
//코이오 노리코에테키타
//사랑을 이겨낸 거야
